Revit 2024 API
ProjectionMethod Enumeration
 Projection method
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public enum ProjectionMethod
Visual Basic
Public Enumeration ProjectionMethod
Visual C++
public enum class ProjectionMethod
Members
Member name | Description
Orthographic |  Orthographic
Perspective |  Perspective
See Also
Autodesk.Revit.DB.DirectContext3D Namespace